from aiogram.types import Message
import Tg_bot.Keyboard as Keyboard

# # # # # # # # # #
# Help for admin  #
# # # # # # # # # #

async def help_inf(message: Message):
    await message.answer("Вітаю ви в блоці допомоги, оберіть на клавіатурі, про що вам цікаво дізнатись",
                         reply_markup=Keyboard.All_help)
    
async def help_inf_two(message: Message):
    await message.edit_text("Вітаю ви в блоці допомоги, оберіть на клавіатурі, про що вам цікаво дізнатись",
                         reply_markup=Keyboard.All_help)

async def get_help_admin(message:Message):
    admins = [
        '''Кнопка "Адміністратори" \n
Вона містить в собі 2 функції: "Таблиці адміністраторів" та "Встановлення/Зміна ролі"\n
Таблиці адміністраторів - тут ви можете переглянути всіх адміністраторів і їх роль в телеграм каналі. За замовчуванням всім видається "Роль не встановлена", роль може дати тільки адміністратор який має статус "Адмін"\n
Встановлення/Зміна ролі - тут адміністратор який має статус "Адмін", може видавати ролі для користувачів, для того щоб телеграм бот розумів і самі користувачі розуміли хто за що відповідає.
'''
    ]
    await message.edit_text(admins[0], reply_markup=Keyboard.One_table)

async def get_help_popular_question(message: Message):
    poppular_question = [
        '''Кнопка "Популярні питання"\n
Ця кнопка потрібна для того, щоб встановлювати поширенні питання для абітурієнтів і студентів. Вона містить в собі функції: "Редагувати питання" та "Записати нове питання"

Редагувати питання - тут ви можете редагувати питання якщо воно втратило свою актуальність або взагалі видалити його з бази данних
Записати нове питання - тут ви записуєте поширенні запитання в базу данних, де вказуєте головну тему(це головний блок, в якому будуть декілька питаннь і відповідів на них), також питання яке більше часто запитують і пишете на нього відповідь.
Це зроблено для того, щоб можна було зменшити кількість людей на онлайн підтримку і повністю автоматизувати процес питань і вступу. База данних гнучка і ви можете в будь який момент додати питання і відповідь на нього. Можете обрати до якого блоку його під'єднати.'''
    ]
    await message.edit_text(poppular_question[0], reply_markup=Keyboard.Two_table)


# # # # # # # # # # 
# Help for user   #
# # # # # # # # # #
    
async def abitur_help(message: Message):
    await message.answer("Вітаю, якщо Вам щось не зрозуміло, ви можете подивитись підказки нижче:",
                         reply_markup=Keyboard.All_abiture_help)

async def abitur_help_two(message: Message):
    await message.edit_text("Вітаю, якщо Вам щось не зрозуміло, ви можете подивитись підказки нижче:",
                            reply_markup=Keyboard.All_abiture_help)

async def help_11(message:Message):
    h_11 = ['''Кнопка "🌐 Онлайн підримка"\n
Тут ви можете залишити своє питання для адміністратора, він обов'язково вам відповість коли буде змога.Також Ви можете з ним поспілкуватись в режимі реального часу і розпиати в нього про всі свої питання які вас цікавлять.
''']
    await message.edit_text(h_11[0], reply_markup=Keyboard.help_11)

async def help_22(message:Message):
    h_22 =['''Кнопка "ℹ️ Інформація"\n
Тут ви можете дізнатись детальну інформацію про університет, факультети. У Вас є можливість переглянути фото університету. Також Ви можете перейти на сайт університету і більш детальни з ним ознайомитись.
''']
    await message.edit_text(h_22[0], reply_markup=Keyboard.help_22)

async def help_33(message:Message):
    h_33 = ['''Кнопка "❓ Поширені запитання"\n
Тут ви можете переглянути популярні питання, які задають студенти і абітурієнти. Відповіді на питання і самі питання можуть змінюватись або додаватись до списку.
Як користуватись: 
1. Ви обираєте блок питань (в цей блок зібрані питання на одну тему)
2. Потім ви обераєте питання яке вас цікавить більше всього
3. Після натискання кнопки ви отримаєате відповідь на своє запитання
Якщо раптом ви не знайдете відповіді на своє питання, ви завжди можете звернутись до онлайн підтримки де вам допоможуть вирішити питання яке Вас турбує.
''']
    await message.edit_text(h_33[0], reply_markup=Keyboard.help_33)

async def help_44(message:Message):
    h_44 =['''Кнопка "⚙️ Налаштування"\n
В налаштуваннях ви можете вимкнути вимкнути розсилку від університету, де буде багато корисної інформації про події університету та івенти які будуть проходити.
Також в налаштуваннях ви можете змінити свій статус з абітурієнта на студента. Для цього вам потрібно поділитись своїм номером телефону і бот автоматично Вас запиши, якщо ви дійсно являєтесь студентом університету.
''']
    await message.edit_text(h_44[0], reply_markup=Keyboard.help_44)

async def help_55(message: Message):
    h_55 = ['''Кнопка "👤 Аккаунт"\n
Ця кнопка відповідає за твій персональний аккаунт, вона буде містити інформацію про тебе, а також там буде твій індетифікаор який потрібно вставити на сайті Journal. Перехід на сайт одним дотиком.            
''']
    await message.edit_text(h_55[0], reply_markup=Keyboard.help_55)