from aiogram.types import Message
import Tg_bot.Keyboard as Keyboard

async def info (message: Message):
    await message.answer("Яку інформацію ви хочете дізнатись?", reply_markup = Keyboard.inf)

async def inf_univ(message:Message):
    text = ['''Привіт! Дякуємо за ваш інтерес до Національного транспортного університету! Ось кілька цікавих фактів про наш університет:

🚆 Лідер у галузі транспорту: Ми є провідним закладом вищої освіти в Україні, який спеціалізується на підготовці фахівців у сфері транспорту та логістики.

📚 Сучасні програми навчання: Ми пропонуємо різноманітні бакалаврські та магістерські програми, які відповідають сучасним вимогам ринку праці.

🌍 Міжнародне співробітництво: Наш університет має численні партнерства з закордонними університетами та організаціями, що дає нашим студентам можливість стажуватися і навчатися за кордоном.

🔬 Наукові дослідження: Ми активно займаємося науковими дослідженнями у галузі транспорту та інфраструктури, залучаючи студентів до участі в реальних проєктах.

👩‍🏫 Досвідчені викладачі: Наші викладачі – це провідні фахівці з великим досвідом у своїй галузі, які готові ділитися своїми знаннями та навичками.

🎓 Кар'єрні можливості: Наші випускники працюють у провідних компаніях та організаціях транспортної галузі, займаючи керівні посади та реалізуючи успішні проєкти.

Якщо у вас є питання або ви хочете дізнатися більше, натисніть кнопку "Онлайн підтримка", де наші фахівці з радістю вам допоможуть, або перегляньте "Поширені питання", де може бути відповідь на ваше питання
''']
    await message.edit_text(text=text[0], reply_markup=Keyboard.inf_university)

async def inf_fac (message: Message):
    text =['''Привіт! Дякуємо за ваш інтерес до факультету транспортних інформаційних технологій Національного транспортного університету! Ось кілька цікавих фактів про наш факультет:

💻 Інноваційні програми: Наш факультет пропонує сучасні програми навчання у сфері інформаційних технологій, що застосовуються в транспортній галузі, включаючи програмування, системний аналіз, кібербезпеку та управління даними.

🌐 Досвідчені викладачі: Наші викладачі – це професіонали з великим досвідом у сфері ІТ та транспорту, які активно займаються науковою діяльністю та впроваджують інноваційні підходи до навчання.

🔧 Практичні навички: Студенти факультету мають можливість працювати з сучасними програмними засобами та технологіями, беручи участь у реальних проєктах та стажуваннях у провідних ІТ-компаніях та транспортних підприємствах.

📈 Перспективи кар'єрного зростання: Наші випускники успішно працюють у різних галузях, зокрема у розробці програмного забезпечення, управлінні інформаційними системами, кібербезпеці та аналізі даних, що відкриває перед ними широкі можливості для кар'єрного зростання.

🔬 Наукові дослідження: Факультет активно займається науковими дослідженнями у сфері ІТ та транспорту, залучаючи студентів до участі у наукових проєктах та конференціях.

🤝 Міжнародні зв'язки: Наш факультет має партнерства з університетами та компаніями з усього світу, що дає студентам можливість брати участь у міжнародних обмінах, стажуваннях та проєктах.

Якщо у вас є питання або ви хочете дізнатися більше, натисніть кнопку "Онлайн підтримка", де наші фахівці з радістю вам допоможуть, або перегляньте "Поширені питання", де може бути відповідь на ваше питання!
''']
    await message.edit_text(text=text[0], reply_markup=Keyboard.inf_facultet)
